ТОИР_демо/src/Catalogs/торо_ВариантыАнализаПоказателейKPI/торо_ВариантыАнализаПоказателейKPI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ВариантыАнализаПоказателейKPI</name>
  <owners>Catalog.торо_ПоказателиKPI</owners>
  <attributes>
    <name>ТипАнализа</name>
    <type>
      <types>EnumRef.торо_ТипыАнализа</types>
    </type>
  </attributes>
  <attributes>
    <name>АгрегацияДанных</name>
    <type>
      <types>EnumRef.торо_АгрегацияДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыбратьСортировку</name>
    <type>
      <types>EnumRef.торо_ВариантыСортировки</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВыбираемыхЭлементов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнитьНормализацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкруглениеДробнойЧасти</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОтображенияПоУмолчанию</name>
    <type>
      <types>EnumRef.торо_ВариантыОтображенияВариантовАнализа</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДиаграммы</name>
    <type>
      <types>EnumRef.торо_ТипыДиаграммПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАнализа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИДПоставляемойМодели</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьНулевыеЗначения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ТОИР_демо/src/Enums/торо_ВариантыОтображенияВариантовАнализа/торо_ВариантыОтображенияВариантовАнализа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ВариантыОтображенияВариантовАнализа</name>
  <enumValues>
    <name>Кратко</name>
  </enumValues>
  <enumValues>
    <name>Диаграмма</name>
  </enumValues>
  <enumValues>
    <name>Таблица</name>
  </enumValues>
</mdclass:Enum>

ТОИР_демо/src/Enums/торо_ВариантыСортировки/торо_ВариантыСортировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ВариантыСортировки</name>
  <enumValues>
    <name>НеИспользуется</name>
  </enumValues>
  <enumValues>
    <name>Лучшие</name>
  </enumValues>
  <enumValues>
    <name>Худшие</name>
  </enumValues>
  <enumValues>
    <name>ПоВозрастанию</name>
  </enumValues>
  <enumValues>
    <name>ПоУбыванию</name>
  </enumValues>
</mdclass:Enum>

ТОИР_демо/src/Catalogs/торо_ВариантыАнализаПоказателейKPI/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	Если ВариантОтображенияПоУмолчанию <> Перечисления.торо_ВариантыОтображенияВариантовАнализа.Диаграмма Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ТипДиаграммы");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ВариантОтображенияПоУмолчанию <> Перечисления.торо_ВариантыОтображенияВариантовАнализа.Диаграмма Тогда
		ТипДиаграммы = Неопределено;
	КонецЕсли;
	
	Если ВыбратьСортировку <> Перечисления.торо_ВариантыСортировки.Лучшие
		И ВыбратьСортировку <> Перечисления.торо_ВариантыСортировки.Худшие Тогда
		КоличествоВыбираемыхЭлементов = 0;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИДПоставляемойМодели = "";
	
КонецПроцедуры

#КонецОбласти
